# https://www.acmicpc.net/problem/1018

# m x n 크기의 각 칸이 검정 또는 흰색으로 칠해진 보드이 있을 때
# 이를 8 x 8 크기로 잘라낸 뒤 몇몇 칸을 흰색 또는 검정색으로 색칠하여
# 온전한 하나의 체스판을 만들어낸다.
# 이 때 색칠을 가장 적게 하게되는 경우의 색칠 횟수를 구하는 것이 문제!

# 해결법
# 아이디어: 보드에서 8 x 8 만큼 잘라낼 수 있는 모든 경우의 수를 고려하는 방식으로 접근
# 보드의 [0. 0]을 좌측최상단으로 하는 체스판으로부터 시작하여 세로방향으로 그 이후 가로방향으로 슬라이드 시키며 모든 경우의 수를 고려!
# 즉, 세로방향으로 슬라이드하는 과정에서 열 인덱스는 0~(m-8)까지 변화하고, 가로방향으로 슬라이드하는 과정에서 행 인덱스는 0~(n-8)까지 변화!
# 이 때 잘라낸 보드의 각 셀에 대한 정보는 '문자열의 리스트'형태로 저장되어 있도록 함!
# 즉, 초기에 보드의 각 셀의 색을 입력받는 시점부터 '문자열'로 한줄씩 읽어와 리스트로 쌓아둠.
# 잘라내 만들어진 체스판은 좌측최상단이 흰색인 경우와 검정색인 경우 두 가지가 있다.
# 하지만 특정 경우에 칠하게 되는 횟수는 다른 한 쪽에서 칠하는 횟수를 전체칸의 수에서 빼기만 하면 된다.
# 즉 '칠하는 수'와 '64-칠하는 수' 둘중 작은 값을 택하면 그 체스판에서 가장 적게 칠하는 횟수가 된다.
# 가장 적게 칠하는 횟수의 초기값을 64로 두고 이를 각 체스판을 가장 적게 칠하는 횟수와 비교하여 새로 없데이트한다.
# 이 과정을 모든 만들어질 수 있는 체스판에 대하여 반복한다.
# 칠해야 하는 횟수를 구하기 위해 2차원의 체스판에서 짝수번 째 셀은 하얀색이, 홀수번째 셀은 검정색이 오는 것으로 가정하여, 실제와 비교를 통해 칠할지를 세린다.